{
  "work": [
    {
      "id": 0,
      "logo": "images/Logos/securitas.png",
      "name": "Securitas Oy",
      "title": "Security Guard",
      "startDate": "06.2023",
      "endDate": "Current",
      "description": "I have been working at Securitas Oy as a security guard, gaining experience in various locations. This role has allowed me to do important work and significantly boosted my confidence.\nAs a security guard, I've had to manage stressful and challenging situations, often making critical decisions on the spot. I've dealt with difficult scenarios, collaborating with colleagues and the police to resolve them, as well as working independently where my decisions were crucial to the outcome of the situation.\nOverall, I am very grateful for these experiences, which have helped me grow personally. I've learned to take responsibility and lead situations outside of my comfort zone, improving both my decision-making skills and my sense of accountability."
    },
    {
      "id": 1,
      "logo": "images/Logos/kesko.png",
      "name": "K-Citymarket",
      "title": "Cashier",
      "startDate": "10.2022",
      "endDate": "06.2023",
      "description": "As a cashier at K-Citymarket, I served hundreds of customers and handled various problem situations, delivering excellent customer service even during rush hours and holidays.\nI also managed the information desk and took responsibility for the entire cashier line, including planning the next day's break schedules and ensuring everyone had their breaks and left on time.\nI had the opportunity to work with great people, and I learned that what matters most in the workplace is the team atmosphere and collaboration."
    },
    {
      "id": 2,
      "logo": "images/Logos/prisma.png",
      "name": "Prisma",
      "title": "Cashier",
      "startDate": "11.2021",
      "endDate": "06.2022",
      "description": "My role as a cashier at Prisma in Lahti was my first job, and it taught me valuable lessons in confidence and professionalism. I learned how to work with customers professionally and ensure their satisfaction. This job pushed me out of my comfort zone and helped me develop teamwork and responsibility skills.\nWorking during peak rush hours taught me not to stress over things beyond my control. Serving hundreds of customers daily was a huge learning experience for my younger self and was a key step in understanding professionalism and handling stressful environments."
    }
  ]
}
